# Variance

In [1]:
import pandas as pd

df = pd.read_csv('C:/Users/Swapnil/Desktop/Python Programs/InternShala - Data Science Python/Module - 3 - Statistics/Module 3 - Datasheets/Median.csv')
df

    Student  Overall Marks  Gender    Subject
0     Anish           9700    Male    English
1   Rishabh             83    Male    English
2      Ajay             78    Male    Physics
3   Abhinav             86    Male  Chemistry
4    Anurag             91    Male    English
..      ...            ...     ...        ...
95  Aaditya             77    Male  Chemistry
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry

[100 rows x 4 columns]

In [2]:
df.head()

   Student  Overall Marks Gender    Subject
0    Anish           9700   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

# Calculate variance

1. Calculate mean.
2. Calculate the distance from mean for each element.
3. Calculate squared distance.
4. Take the average of the squared distance

In [7]:
# 1. Mean 

mean = df['Overall Marks'].mean()
mean

164.24

In [8]:
# 2. Calculate the distance from mean for each element

difference = df['Overall Marks'] - mean
difference

0     9535.76
1      -81.24
2      -86.24
3      -78.24
4      -73.24
       ...
95     -87.24
96    -109.24
97    -157.24
98     -91.24
99     -82.24
Name: Overall Marks, Length: 100, dtype: float64

In [9]:
# 3. Calculate squared distance

squared_dist = difference ** 2
squared_dist

0     9.093072e+07
1     6.599938e+03
2     7.437338e+03
3     6.121498e+03
4     5.364098e+03
          ...
95    7.610818e+03
96    1.193338e+04
97    2.472442e+04
98    8.324738e+03
99    6.763418e+03
Name: Overall Marks, Length: 100, dtype: float64

In [10]:
# 4.Take the average of the squared distance

variance = squared_dist.mean()
variance

919170.8423999996

# Using built in formula for variance

In [12]:
variance_formulae = df['Overall Marks'].var(ddof = 0)
print(variance_formulae)

919170.8423999996

## Mean, Mode & Median

In [3]:
df['Overall Marks'].mean()

164.24

In [4]:
df['Overall Marks'].mode()

0    88
dtype: int64

In [5]:
df['Overall Marks'].median()

77.0

In [15]:
# Quiz question

In [13]:
new_table = pd.DataFrame({'Count':[7, 6, 8, 4, 2, 7, 6, 7, 6, 5, 20]})
new_table

   Count
0      7
1      6
2      8
3      4
4      2
5      7
6      6
7      7
8      6
9      5

In [14]:
new_table['Count'].var(ddof = 0)

2.7600000000000002

In [16]:
new_tabl = pd.DataFrame({'Count':[7, 6, 8, 4, 2, 7, 6, 7, 6, 5, 20]})
new_tabl

    Count
0       7
1       6
2       8
3       4
4       2
5       7
6       6
7       7
8       6
9       5
10     20

In [17]:
new_tabl['Count'].var(ddof = 0 )

19.173553719008268